tutorial/CounterFlowFlame2D/NC12H26_Yao/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    fuel
    {
        type            patch;
        nFaces          40;
        startFace       7860;
    }
    air
    {
        type            patch;
        nFaces          40;
        startFace       7900;
    }
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       7940;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          8000;
        startFace       8140;
    }
    internal
    {
        type            internal;
        inGroups        List<word> 1(internal);
        nFaces          0;
        startFace       16140;
    }
)

// ************************************************************************* //
